MicrochipTech/dspic33a-high-speed-adc-example/cli.c
void console_flush(void)
{
    console_drain();
}

/* Bring the console back up from scratch, assuming nothing about the
 * current state of the pins, the PPS mapping or the UART.
 *
 * This is what _DefaultInterrupt() calls before it reports a trap. A trap
 * can have happened anywhere, including inside clock_init() or after some
 * other code disturbed the peripheral, and in that situation
 * console_sync_baud() is not enough: it only fixes the baud divider, and
 * it trusts clock.c to say what the clock is. Here the routing is written
 * again and the baud rate is picked from the clock the CPU is actually
 * on, so the one message that explains the fault has the best chance of
 * getting out.
 *
 * Safe to call when the console is already up - it re-writes the same
 * values - and safe from interrupt context: no waiting except the bounded
 * drain. */
void console_force_up(void)
{
    console_drain();                   /* bounded; keep a partial line    */

    CONSOLE_TX_TRIS  = 0u;
    CONSOLE_RX_TRIS  = 1u;
    RPCONbits.IOLOCK = 0u;
    CONSOLE_RX_RPINR = CONSOLE_RX_RP;
    CONSOLE_TX_RPOR  = CONSOLE_TX_FN;
    RPCONbits.IOLOCK = 1u;

    uart2_setup(clock_cpu_on_pll() ? UART_BRG_PLL : UART_BRG_FRC);
}

/* Make the baud generator match whatever clock the CPU is on right now.
 * fail() calls this first: a failure after the switch to PLL2 but before
 * cli_init() would otherwise print at the wrong rate. */
void console_sync_baud(void)
{
    const uint32_t want = clock_cpu_on_pll() ? UART_BRG_PLL : UART_BRG_FRC;
    if (U2BRG != want) {
        console_drain();
        uart2_setup(want);
    }
}

/* Output sink for the parser: take what fits into the transmit FIFO and
 * report how much that was. The parser re-offers the rest (see
 * cmd_parser.h, "Flow control"). */
static size_t console_write(const char *data, size_t len)
{
    size_t n = 0;
    while ((n < len) && !U2STATbits.TXBF) {
        U2TXB = (uint8_t)data[n++];
    }
    return n;
}

/* Called by the parser while the transmit FIFO is full. Nothing to yield
 * to on a bare-metal build, but this is the moment to look for Ctrl+C:
 * a long reply must be abortable, and while it drains the receive
 * interrupt cannot run (we are inside it). Other bytes typed during a
 * reply are dropped. */
static void console_yield(void)
{
#ifdef __MPLAB_DEBUGGER_SIMULATOR
    return;     /* the simulator has no UART receiver: RXBE never rises */
#endif
    while (!U2STATbits.RXBE) {
        if ((uint8_t)U2RXB == 0x03u) {
            cmd_parser_abort();
        }
    }
}

/* The parser thread: every received byte goes to the line editor, and
 * a completed line is dispatched right here, in interrupt context. */
void __attribute__((interrupt, no_auto_psv)) _U2RXInterrupt(void)
{
    while (!U2STATbits.RXBE) {
        cmd_parser_feed_char((char)U2RXB);
    }
    IFS3bits.U2RXIF = 0u;
}

/* ------------------------------------------------------------------ *
 * Small formatting helpers - no printf, so the reply cost is predictable
 * ------------------------------------------------------------------ */
static char *u32_to_str(char *out, uint32_t v)
{
    char tmp[11];
    int i = 0;
    do { tmp[i++] = (char)('0' + (v % 10u)); v /= 10u; } while (v != 0u);
    while (i > 0) { *out++ = tmp[--i]; }
    *out = '\0';
    return out;
}

static char *u32_to_hex(char *out, uint32_t v)
{
    static const char digits[] = "0123456789ABCDEF";
    *out++ = '0'; *out++ = 'x';
    for (int shift = 28; shift >= 0; shift -= 4) {
        *out++ = digits[(v >> shift) & 0xFu];
    }
    *out = '\0';
    return out;
}

static char *copy_str(char *out, const char *s)
{
    while (*s) { *out++ = *s++; }
    *out = '\0';
    return out;
}

/* "key: value" lines.
 *
 * The key is NOT copied into the line buffer. It used to be, into a
 * char[48], and two callers overflowed it: the self-test's
 * "[selftest] mean on internal 15/16 VDD (expect ~3840)" is 52
 * characters, so with the value and CRLF it wrote 67 bytes into 48 - a
 * stack overrun on the *success* path, which would have corrupted the
 * return address at the exact moment the board reported that everything
 * worked. Printing the key straight out and formatting only the number
 * removes the failure mode instead of enlarging the buffer: the value is
 * at most 10 digits or 10 hex characters, so 16 bytes is provably enough
 * no matter how long a key some later caller passes.
 *
 * The console_* variants go out blocking through console_puts() (trace,
 * fail, trap, dump); put_kv() goes through the parser and is for command
 * replies. */
void console_kv(const char *key, uint32_t v)
{
    char num[16];
    char *p = u32_to_str(num, v);
    copy_str(p, "\r\n");
    console_puts(key);
    console_puts(": ");
    console_puts(num);
}

void console_kv_hex(const char *key, uint32_t v)
{
    char num[16];
    char *p = u32_to_hex(num, v);
    copy_str(p, "\r\n");
    console_puts(key);
    console_puts(": ");
    console_puts(num);
}

void console_regs_dump(void)
{
    console_puts("[regs] uart\r\n");
    console_kv_hex("IEC3", IEC3);           /* U2RX enable,  bit 6       */
    console_kv_hex("IFS3", IFS3);           /* U2RX flag,    bit 6       */
    console_kv_hex("IPC12", IPC12);         /* U2RX priority, bits 26:24 */
    console_kv_hex("U2CON", U2CON);
    console_kv_hex("U2STAT", U2STAT);
    console_kv_hex("U2BRG", U2BRG);
    /* Pin routing of the console itself: with a silent terminal these say
     * whether console_early_init() took effect. Expected: IOLOCK set,
     * RP114R (bits 14:8 of RPOR28) = 21 = 0x15, U2RXR (bits 23:16 of
     * RPINR13) = 50 = 0x32, TRISH bit 1 clear, TRISD bit 1 set. */
    console_kv_hex("RPCON", RPCON);
    console_kv_hex("RPOR28", RPOR28);
    console_kv_hex("RPINR13", RPINR13);
    console_kv_hex("TRISH", TRISH);
    console_kv_hex("TRISD", TRISD);
}

static void put_kv(const char *key, uint32_t v)
{
    char num[16];
    char *p = u32_to_str(num, v);
    copy_str(p, "\r\n");
    cmd_parser_write(key);
    cmd_parser_write(": ");
    cmd_parser_write(num);
}

static void put_line(const char *s)
{
    cmd_parser_write(s);
    cmd_parser_write("\r\n");
}

/* One status line, blocking, for the periodic trace from main(). */
void console_status_line(void)
{
    char line[176];                       /* 163 used with every field at max */
    char *p = copy_str(line, "[stat] blocks=");
    p = u32_to_str(p, blocks_done);
    p = copy_str(p, " overrun=");  p = u32_to_str(p, dma_overrun);
    p = copy_str(p, " late=");     p = u32_to_str(p, late_service);
    p = copy_str(p, " missed=");   p = u32_to_str(p, proc_missed);
    p = copy_str(p, " addr_err="); p = u32_to_str(p, dma_addr_err);
    p = copy_str(p, " bus_err=");  p = u32_to_str(p, dma_bus_err);
    p = copy_str(p, " last=");     p = u32_to_str(p, last_sample);
    p = copy_str(p, " input=");    p = u32_to_str(p, capture_pinsel());
    p = copy_str(p, " samc=");     p = u32_to_str(p, capture_samc());
    p = copy_str(p, " run=");      p = u32_to_str(p, capture_running() ? 1u : 0u);
    /* Does the ADC's channel-done event reach the CPU side at all? It is
     * the DMA trigger and stays masked (IEC6 = 0), so this flag being 1
     * while the DMA runs says the event is visible to the CPU - the
     * precondition for the vector-201 trap TROUBLESHOOTING 2.0b describes. */
    p = copy_str(p, " ad3if=");    p = u32_to_str(p, (uint32_t)IFS6bits.AD3CH0IF);
    copy_str(p, "\r\n");
    console_puts(line);
}

/* Decimal argument in [lo, hi]; false (and NAK) otherwise. */
static bool arg_u32(const char *s, uint32_t lo, uint32_t hi, uint32_t *out)
{
    char *end;
    unsigned long v;
    if (*s == '\0') { return false; }
    v = strtoul(s, &end, 0);
    if ((*end != '\0') || (v < lo) || (v > hi)) { return false; }
    *out = (uint32_t)v;
    return true;
}

static void usage(const char *text)
{
    cmd_parser_write("usage: ");
    put_line(text);
    cmd_parser_fail();
}

/* ------------------------------------------------------------------ *
 * Commands
 * ------------------------------------------------------------------ */
static void cmd_version_fn(int argc, char **argv)
{
    (void)argc; (void)argv;
    put_line("adc_dma_40msps " __DATE__ " " __TIME__);
    put_line("board: EV74H48A, dsPIC33AK512MPS512 GP DIM");
    put_kv("adc core", ADC_INSTANCE);
    put_kv("default input", ADC_PINSEL);
    put_kv("samples per half", SAMPLES_PER_HALF);
}
CMD_DEFINE(version, "version", cmd_version_fn, "version - build, board, ADC core");

static void cmd_status_fn(int argc, char **argv)
{
    (void)argc; (void)argv;
    put_kv("running", capture_running() ? 1u : 0u);
    put_kv("blocks", blocks_done);
    put_kv("overrun", dma_overrun);
    put_kv("late", late_service);
    put_kv("missed", proc_missed);
    put_kv("addr_err", dma_addr_err);
    put_kv("bus_err", dma_bus_err);
    put_kv("input", capture_pinsel());
    put_kv("samc", capture_samc());
    put_kv("last", last_sample);
    put_kv("selftest_mean", selftest_mean);
    put_kv("fail_code", fail_code);
}
CMD_DEFINE(status, "status", cmd_status_fn, "status - run state and counters");

