MicrochipTech/dspic33a-high-speed-adc-example/cli.c
static void cmd_regs_fn(int argc, char **argv)
{
    (void)argc; (void)argv;
    regs_dump();
}
CMD_DEFINE(regs, "regs", cmd_regs_fn, "regs - clock, ADC, DMA and UART registers");

static void cmd_start_fn(int argc, char **argv)
{
    (void)argc; (void)argv;
    capture_start();
    put_kv("running", 1u);
}
CMD_DEFINE(start, "start", cmd_start_fn, "start - start the burst stream");

static void cmd_stop_fn(int argc, char **argv)
{
    (void)argc; (void)argv;
    capture_stop();
    put_kv("running", 0u);
}
CMD_DEFINE(stop, "stop", cmd_stop_fn, "stop - stop after the current buffer");

static void cmd_samc_fn(int argc, char **argv)
{
    uint32_t v;
    if ((argc != 2) || !arg_u32(argv[1], 0u, 31u, &v)) {
        usage("samc <0..31>  (sample time (2*SAMC+0.5) TAD, rate 40/(SAMC+1) MSPS)");
        return;
    }
    (void)capture_set_input(capture_pinsel(), (uint8_t)v);
    put_kv("samc", v);
}
CMD_DEFINE(samc, "samc", cmd_samc_fn, "samc <0..31> - sample time in TAD steps");

static void cmd_input_fn(int argc, char **argv)
{
    uint32_t v;
    if ((argc != 2) || !arg_u32(argv[1], 0u, 15u, &v)) {
        usage("input <0..15>  (PINSEL of the ADC core, 6 = internal 15/16 VDD)");
        return;
    }
    (void)capture_set_input((uint8_t)v, capture_samc());
    put_kv("input", v);
}
CMD_DEFINE(input, "input", cmd_input_fn, "input <0..15> - analog input (PINSEL)");

static void cmd_selftest_fn(int argc, char **argv)
{
    uint32_t mean = 0;
    (void)argc; (void)argv;
    const uint32_t rc = capture_selftest(&mean);
    put_kv("selftest_mean", mean);
    if (rc == 0u)      { put_line("selftest: ok (3648..4032)"); }
    else if (rc == 6u) { put_line("selftest: no data - is the stream running?"); }
    else if (rc == 7u) { put_line("selftest: mean outside 3648..4032"); }
    else               { put_line("selftest: DMA channel disabled (address fault?)"); }
    if (rc != 0u) { cmd_parser_fail(); }
}
CMD_DEFINE(selftest, "selftest", cmd_selftest_fn, "selftest - sample the internal reference");

static void cmd_stats_fn(int argc, char **argv)
{
    const volatile uint16_t *b = capture_completed_half();
    uint32_t mn = 0xFFFFu, mx = 0u, acc = 0u;
    (void)argc; (void)argv;
    for (uint32_t i = 0; i < SAMPLES_PER_HALF; i++) {
        const uint16_t v = b[i];
        if (v < mn) { mn = v; }
        if (v > mx) { mx = v; }
        acc += v;
    }
    put_kv("half", ready_half);
    put_kv("min", mn);
    put_kv("max", mx);
    put_kv("mean", acc / SAMPLES_PER_HALF);
    put_kv("pp", mx - mn);
}
CMD_DEFINE(stats, "stats", cmd_stats_fn, "stats - min/max/mean of the completed half");

static void cmd_dump_fn(int argc, char **argv)
{
    uint32_t count = 64u, offset = 0u;
    if ((argc > 3) ||
        ((argc >= 2) && !arg_u32(argv[1], 1u, SAMPLES_PER_HALF, &count)) ||
        ((argc == 3) && !arg_u32(argv[2], 0u, SAMPLES_PER_HALF - 1u, &offset))) {
        usage("dump [count 1..1024] [offset 0..1023]");
        return;
    }
    if (offset + count > SAMPLES_PER_HALF) {
        count = SAMPLES_PER_HALF - offset;
    }
    const volatile uint16_t *b = capture_completed_half();
    char line[80];
    for (uint32_t i = 0; i < count; i += 8u) {
        char *p = line;
        /* "nnnn:" index, then up to eight values */
        uint32_t idx = offset + i;
        for (int d = 3; d >= 0; d--) { p[d] = (char)('0' + idx % 10u); idx /= 10u; }
        p += 4; *p++ = ':';
        for (uint32_t k = 0; (k < 8u) && (i + k < count); k++) {
            *p++ = ' ';
            p = u32_to_str(p, b[offset + i + k]);
        }
        copy_str(p, "\r\n");
        cmd_parser_write(line);
        if (cmd_parser_aborted()) { return; }
    }
}
CMD_DEFINE(dump, "dump", cmd_dump_fn, "dump [count] [offset] - samples of the completed half");

static void cmd_clear_fn(int argc, char **argv)
{
    (void)argc; (void)argv;
    counters_clear();
    put_line("counters cleared");
}
CMD_DEFINE(clear, "clear", cmd_clear_fn, "clear - zero the error counters");

static void cmd_led_fn(int argc, char **argv)
{
    if (argc == 2) {
        if (strcmp(argv[1], "on") == 0)   { led_mode(1u); put_line("led: on");   return; }
        if (strcmp(argv[1], "off") == 0)  { led_mode(0u); put_line("led: off");  return; }
        if (strcmp(argv[1], "auto") == 0) { led_mode(2u); put_line("led: auto"); return; }
    }
    usage("led on|off|auto");
}
CMD_DEFINE(led, "led", cmd_led_fn, "led on|off|auto - LED0");

/* ------------------------------------------------------------------ *
 * sweep - the rate measurement, automated
 *
 * For each sample time from SAMC 31 (1.25 MSPS) down to 0 (40 MSPS):
 * stop the stream, wait for the burst to end, set the sample time,
 * clear the counters, run `halves` buffer halves, read the counters.
 * Three times per rate, with the CPU doing something different while
 * the DMA runs, because the first board run could not tell whether the
 * overruns come from the DMA bus itself or from the CPU competing for
 * it (DS70005591D 13.4.4, one shared DMA data bus):
 *
 *   idle     the CPU polls blocks_done, a RAM variable, nothing else
 *   process  the CPU runs capture_service(), i.e. process_buffer() on
 *            every completed half - what the application would do
 *   sfr      the CPU reads U2STAT in a tight loop - the worst case, a
 *            CPU that hammers the peripheral bus (the console does this
 *            while it prints)
 *
 * One line per rate. overrun must be 0 for a rate to be usable. The
 * whole sweep runs inside the receive interrupt, like every command;
 * the DMA interrupt preempts it, the main loop is starved meanwhile
 * (counters are cleared afterwards, so that does not show up). The
 * previous sample time and run state are restored at the end.
 * ------------------------------------------------------------------ */
#define SWEEP_HALVES_DEFAULT  2000u          /* 2 M samples per point   */
#define SWEEP_WAIT_LIMIT      400000000u     /* loop iterations, ~10 s  */

enum sweep_load { SWEEP_IDLE = 0, SWEEP_PROCESS = 1, SWEEP_SFR = 2 };

/* Run `halves` halves at `samc` with the CPU under `load` meanwhile.
 * Returns false if the stream stopped or never delivered. */
static bool sweep_point(uint8_t samc, uint32_t halves, enum sweep_load load)
{
    uint32_t n = SWEEP_WAIT_LIMIT;
    capture_stop();
    while (capture_burst_active() && (--n != 0u)) { SIM_DMA_TICK(); }
    if (n == 0u) { return false; }
    (void)capture_set_input(capture_pinsel(), samc);   /* idle: applied now */
    counters_clear();
    const uint32_t target = blocks_done + halves;
    capture_start();
    n = SWEEP_WAIT_LIMIT;
    while (blocks_done < target) {
        SIM_DMA_TICK();
        if (load == SWEEP_PROCESS)      { (void)capture_service(); }
        else if (load == SWEEP_SFR)     { (void)U2STAT; }
        if (--n == 0u) { capture_stop(); return false; }
    }
    capture_stop();
    return true;
}

static void sweep_row(uint8_t samc, uint32_t halves)
{
    uint32_t ov[3];
    bool     ok[3];
    uint32_t late = 0, missed = 0;
    for (int l = 0; l < 3; l++) {
        ok[l] = sweep_point(samc, halves, (enum sweep_load)l);
        ov[l] = dma_overrun;
        if (l == SWEEP_PROCESS) { late = late_service; missed = proc_missed; }
    }
    /* Longest line: 116 characters plus NUL; every number is at most
     * 10 digits, "STOPPED" is shorter. */
    char line[128];
    char *p = copy_str(line, "samc ");        p = u32_to_str(p, samc);
    p = copy_str(p, "  ksps ");               p = u32_to_str(p, 40000u / ((uint32_t)samc + 1u));
    p = copy_str(p, "  overrun idle/process/sfr ");
    for (int l = 0; l < 3; l++) {
        if (l) { *p++ = '/'; }
        p = ok[l] ? u32_to_str(p, ov[l]) : copy_str(p, "STOPPED");
    }
    p = copy_str(p, "  late ");               p = u32_to_str(p, late);
    p = copy_str(p, "  missed ");             p = u32_to_str(p, missed);
    copy_str(p, "\r\n");
    cmd_parser_write(line);
}

static void cmd_sweep_fn(int argc, char **argv)
{
    uint32_t halves = SWEEP_HALVES_DEFAULT;
    if ((argc > 2) || ((argc == 2) && !arg_u32(argv[1], 10u, 100000u, &halves))) {
        usage("sweep [halves per point 10..100000, default 2000]");
        return;
    }
    static const uint8_t samcs[] = { 31u, 15u, 7u, 3u, 1u, 0u };
    const uint8_t keep_samc   = capture_samc();
    const bool    was_running = capture_running();

    put_kv("sweep: halves per point", halves);
    put_line("idle = CPU polls RAM only, process = main-loop processing, sfr = CPU polls an SFR");
    put_line("overrun must be 0 for a usable rate; late/missed are from the process run");
    for (uint32_t i = 0; i < sizeof samcs / sizeof samcs[0]; i++) {
        sweep_row(samcs[i], halves);
        if (cmd_parser_aborted()) { break; }
    }

    (void)capture_set_input(capture_pinsel(), keep_samc);
    counters_clear();
    if (was_running) { capture_start(); }
    put_line("sweep done: counters cleared, previous samc and run state restored");
}
CMD_DEFINE(sweep, "sweep", cmd_sweep_fn, "sweep [halves] - overrun vs sample rate, 1.25..40 MSPS");

